# Reset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointIterator..::..Reset Method
PointIterator Class See Also
---
Resets the iterator to the beginning of the collection.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# See Also
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace